app/controllers/microposts_controller.rb

INSERT INTO "microposts" ("content", "user_id", "created_at", "updated_at") VALUES ('nuevo tuit!', 1, '2011-06-05 00:21:15.114383', '2011-06-05 00:21:15.114383')
---
  def create

    @micropost  = current_user.microposts.build(params[:micropost])
    if @micropost.save