app/controllers/users_controller.rb

SELECT "users".* FROM "users" WHERE "users"."id" IS NULL LIMIT 1
SELECT "microposts".* FROM "microposts" WHERE ("microposts".user_id = 1) ORDER BY microposts.created_at DESC LIMIT 30 OFFSET 0
SELECT COUNT(*) FROM "microposts" WHERE ("microposts".user_id = 1)
---
  def show

    @user = User.find(params[:id])
    @title = @user.name
    @microposts = @user.microposts.paginate(:page => params[:page])

INSERT INTO "users" ("name", "email", "created_at", "updated_at", "encrypted_password", "salt", "admin") VALUES ('jonathan', 'jonathan@jonathanrm.com', '2011-05-28 23:31:01.587751', '2011-05-28 23:31:01.587751', 'bac120afb01b4241fec5c05e38c375f7aeb829aaaaf0dae5c9032ae37040f296', 'c3f3b46b94e5eff37fc54dcfbac582df2696d35917fd98691aeb4c70a6a563c0', 'f')
---
  def create

    if signed_in?

      redirect_to(root_path)

    else

      @user = User.new(params[:user])

      if @user.save

SELECT "users".* FROM "users" WHERE "users"."id" IS NULL LIMIT 1
UPDATE "users" SET "name" = 'New Name', "email" = 'user@example.org', "encrypted_password" = '309d44501840b39d1ebc84d289de90defb07b9db761b9c43ec6497c3909086e5', "updated_at" = '2011-05-22 22:16:56.393630' WHERE "users"."id" = 1
---
  def update

    @user = User.find(params[:id])
    if @user.update_attributes(params[:user])

SELECT "users".* FROM "users" WHERE "users"."id" IS NULL LIMIT 1
DELETE FROM "users" WHERE "users"."id" = 4
---
  def destroy

    destroyUser = User.find(params[:id])

    if(current_user.admin? && destroyUser == current_user)
      flash[:error] = "An admin user must be deleted by another user"
    else
      destroyUser.destroy